package com.tinyprojects.friendroid.essentials;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

public class CookActivity extends AppCompatActivity {

    ListView cookList;
    String[] cookTitle= {"এবার বাড়িতে বসেই মিষ্টিমুখ","৫ মিনিটে তৈরি করুন চকলেট কেক","টমেটো দিয়ে স্পাইসি পাস্তা","নাস্তায় আলুর পরোটা",
            "বাড়িতে তৈরি সুজির রসগোল্লা","বিকেলের নাস্তায় সুস্বাদু 'চিকেনবল'","বেগুনের নতুন রেসিপি বেগুন কাবাব","মজাদার ও লোভনীয় ব্রাউনির রেসিপি","মজাদার প্রন ককটেল সালাদ রেসিপি",
            "মিষ্টি কুমড়ার ফুলের বড়া","সকালের নাশতায় সুস্বাদু কিমা পরোটা","সহজেই তৈরি করুন রেড ভেলভেট কেক"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_cook);
        cookList = findViewById(R.id.lvCook);

        ChildListAdapter cookAdapter = new ChildListAdapter(this,cookTitle);
        cookList.setAdapter(cookAdapter);
        cookList.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            Intent intent = new Intent(CookActivity.this,ReadingActivity.class);
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                if (i==0){
                    intent.putExtra("Title","এবার বাড়িতে বসেই মিষ্টিমুখ");
                    intent.putExtra("Description","ইচ্ছে করলে বাড়িতেও রসগোল্লা বানাতে পারেন। কী ভাবছেন বড্ড কঠিন? মোটেও না।\n" +
                            "\n" +
                            "যা লাগবে:\n" +
                            "\n" +
                            "চিনি, দুধ, লেবু অথবা টক দই, জল, ছাঁকনি এবং পাত্র।\n" +
                            "\n" +
                            "তৈরি প্রণালী:\n" +
                            "\n" +
                            "প্রথমে ছানা তৈরি\n" +
                            "\n" +
                            "ওভেনে একটি প্যান বসান। তাতে লিটারখানেক দুধ ঢেলে দিন। উনুন জ্বালিয় দুধ ফোটানো শুরু করুন। দুধ যত ভাল মানের হবে, ছানা তত খোলতাই হবে। এবার একটি বাটিতে টক দই রাখুন। এক লিটার দুধের জন্য মোটামুটি পোয়া খানেক (২৫০ গ্রাম) মতো টকদই-ই যথেষ্ট।\n" +
                            "\n" +
                            "দুধ ফোটা শুরু হলে টক দইটি ঢেলে দিন। এক্ষেত্রে কেউ লেবু বা ভিনিগারও ব্যবহার করতে পারেন। তবে তাতে রসগোল্লাতে গন্ধ থেকে যাওয়ার ক্ষীণ সম্ভাবনা থাকে। টক দইয়ের ক্ষেত্রে তাও থাকবে না। ফুটন্ত দুধে টক দই পড়া মাত্র ছানা কাটতে শুরু করবে। \n" +
                            "চামচ বা খুন্তির সাহায্যে ভাল করে নেড়ে নিন। একটু অপেক্ষা করুন। পুরো জল কেটে গেলে বুঝবেন ছানা তৈরি। মনে রাখবেন রসগোল্লার ছানা বেশিক্ষণ ওভেনে রাখা যাবে না।\n" +
                            "\n" +
                            "এবার পুরো বস্তুটি ছাঁকনিতে ঢেলে দিন। পরিচ্ছন্ন কাপড় ব্যবহার করতে পারেন ছাঁকনি হিসেবে। \n" +
                            "জল আর ছানা আলাদা হয়ে যাবে। ব্যস ছানা তৈরি হয়ে গেল। তুলে একটি থালায় রাখুন। অথবা কাপড়েই ঝুলিয়ে রাখুন, যাতে ঝল ঝরতে থাকে এবং ধীরে ধীরে ঠাণ্ডা হয়। কিন্তু ছানা ঠাণ্ডা জলে ধোবেন না। \n" +
                            "মনে রাখবেন, জলে ঢুকলে স্পঞ্জি রসগোল্লা তৈরি হবে। তবে চিরায়ত রসগোল্লা তৈরির জন্য ঠাণ্ডা জল না দেওয়াই ভাল। থালায় রাখলে বা কাপড়ে ঝুলিয়ে রাখলে বাকি যে জল থাকবে সেটাও ঝরে যাবে।");
                    startActivity(intent);
                }else if (i==1){
                    intent.putExtra("Title","৫ মিনিটে তৈরি করুন চকলেট কেক");
                    intent.putExtra("Description","এখন চটজলদি রান্নার যুগ। ঝটপট বানিয়ে ফেলতে হবে সুস্বাদু খাবার। \n" +
                            "তবেই না সংসার সামলে, অফিস সামলে বন্ধুদের সঙ্গে আড্ডার সময় বার করা যাবে। \n" +
                            "\n" +
                            "উপকরণ:\n" +
                            "ময়দা ১০০ গ্রাম, গুঁড়ো চিনি ১০০ গ্রাম, মাখন ১২৫ গ্রাম, বেকিং পাউডার ১ চা-চামচ, কোকো পাউডার ৪ টেবিল চামচ, ভ্যানিলা এসেন্স ১ চা-চামচ, ডিম ৩টি, কুচোনো আখরোট ২ টেবিল চামচ।\n" +
                            "\n" +
                            "প্রস্তুত প্রণালী:\n" +
                            "প্রথমে ময়দা চেলে রাখুন। চিনি ও মাখন ভাল করে ফেটিয়ে নিন। এবার একটু করে ময়দা ও একটা করে ডিম দিয়ে আবার ফেটিয়ে নিন।\n" +
                            "\n" +
                            "এরপর কোকো পাউডার, আখরোট ও ভ্যানিলা এসেন্স মেশান। কাট অ্যান্ড ফোল্ড মেথডে কেকের মিক্স তৈরি করুন। একটা চৌকো মাইক্রোওভেন-সেফ পাত্র বেছে নিন। পাত্রটি মাখন দিয়ে গ্রিজ করে নিন।\n" +
                            "\n" +
                            "এবার নিচে একটু ময়দা ছিটিয়ে দিন। ১০০% পাওয়ার লেভেলে ১ মিনিট মাইক্রো করে পাত্রটি গরম করে নিন। এরবার ওই পাত্রে কেকের মিশ্রণটি সমানভাবে ঢেলে দিন। ১০০% পাওয়ার লেভেলে সাড়ে চার মিনিট মাইক্রো মোডে গিয়ে মাইক্রো করে নিন।\n" +
                            "\n" +
                            "৫ মিনিট স্ট্যান্ডিং টাইম দিয়ে কেক পিস করে কেটে নিয়ে গরম গরম সার্ভ করুন। তৈরি হয়ে গেল আপনার চকলেট কেক।");
                    startActivity(intent);
                }else if (i==2){
                    intent.putExtra("Title","টমেটো দিয়ে স্পাইসি পাস্তা");
                    intent.putExtra("Description","ছোট-বড় সবারই বেশ পছন্দের খাবার পাস্তা। তবে টমেটো দিয়ে স্পাইসি পাস্তা খেতে খুবই সুস্বাদু। খুব সহজে বাসায় বসে খাবারটি তৈরি করা যায়।\n" +
                            "তাই দেরি না করে  জেনে নিন কী কী উপকরণ লাগবে এই রেসিপিতে এবং কীভাবে তৈরি করবেন দারুণ সুস্বাদু টমেটো পাস্তা।\n" +
                            "\n" +
                            "উপকরণ :\n" +
                            "পাস্তা তিন কাপ, পেঁয়াজ কুচি একটি, গাজর কুচি একটি, টমেটো কুচি দুটি, রসুন দুই/তিন কোয়া, আদা সামান্য, \n" +
                            "কাঁচামরিচ দুটি, টমেটো সস এক টেবিল চামচ, ধনেপাতা কুচি সামান্য, চিজ কুচি এক চা চামচ, তেল পরিমাণমতো এবং লবণ স্বাদমতো।\n" +
                            "\n" +
                            "প্রস্তুত প্রণালি :\n" +
                            "প্রথমে পাস্তা সেদ্ধ করে পানি ঝরিয়ে নিন। এর পর টমেটো, রসুন, আদা ও কাঁচামরিচ একসঙ্গে মিশিয়ে ব্লেন্ডারে ভালো করে পেস্ট করে নিন। \n" +
                            "এবার একটি প্যানে তেল গরম করে এতে পেঁয়াজ কুচি ও গাজর কুচি দিয়ে ভাজতে থাকুন। টমেটোর মিশ্রণটি এর মধ্যে দিয়ে দিন। \n" +
                            "এখন এতে লবণ ও টমেটো সস দিয়ে নাড়তে থাকুন। সস তৈরি হয়ে গেলে এর মধ্যে সেদ্ধ পাস্তা দিয়ে দুই থেকে তিন মিনিট রান্না করে চুলা থেকে নামিয়ে ফেলুন। \n" +
                            "ব্যস, খুব সহজে তৈরি হয়ে গেল টমেটো পাস্তা।");
                    startActivity(intent);
                }else if (i==3){
                    intent.putExtra("Title","নাস্তায় আলুর পরোটা");
                    intent.putExtra("Description","আলু এমন এক সবজি, যা আমরা সব রকমের খাবারে দিতে পছন্দ করি।\n" +
                            "\n" +
                            "আলু পছন্দ করে না, এমন মানুষ আসলে কমই আছে।\n" +
                            "\n" +
                            "একটা কথা প্রচলিত আছে, বেশি বেশি আলু খান, ভাতের উপর চাপ কমান। আলু অনেক সস্তা খাবার এবং অবশ্যই অনেক সুস্বাদু খাবার। \n" +
                            "পুষ্টিগুণের দিক দিয়েও আলু অনেক এগিয়ে। আসুন জেনে নেই আলু দিয়ে পরোটা তৈরির উপায়।\n" +
                            "\n" +
                            "উপকরণ: ৬ খানি পরোটার জন্য ময়দা, আলু ৪টি, ধনেপাতা এক আঁটি, লবণ পরিমাণমত, ১ চা-চামচ গুঁড়া মরিচ, একটু পাতিলেবুর রস।\n" +
                            "\n" +
                            "প্রস্তুত প্রণালী: আলুর খোসা ছাড়িয়ে চটকে এর সঙ্গে গুঁড়া মরিচ, লবণ ও সরু করে কুচানো ধনেপাতা চটকে একটু পাতিলেবুর রস দিন। \n" +
                            "লবণ ও ময়দা দিয়ে পরোটার জন্য মাখুন এবং ৬টি লেচি তৈরি করুন। \n" +
                            "প্রত্যেকটি লেচির মাঝে আলুর পুর দিয়ে বেলে ঘি বা তেলে ভেজে নিন এবং গরম গরম পরিবেশন করুন।");
                    startActivity(intent);
                }else if (i==4){
                    intent.putExtra("Title","বাড়িতে তৈরি সুজির রসগোল্লা");
                    intent.putExtra("Description","মিষ্টি খেতে কম-বেশি সবারই ভালো লাগে। কিন্তু সে মিষ্টি যদি হয় বাড়িতে তৈরি তাহলে তো আর কথাই নাই। \n" +
                            "তবে যাদের কাছে ছানার রসগোল্লা বানাতে ঝামেলা লাগে অথবা একটু সময়সাপেক্ষ মনে হয়, \n" +
                            "তারা সুজির রসগোল্লাটা বানাতে পারেন। \n" +
                            "এটা বানানো খুবই সহজ এবং সময়ও কম লাগে। তাছাড়া এই রসগোল্লাও কিন্তু স্পাঞ্জি হয়।\n" +
                            "\n" +
                            "কিন্তু ছানার রসগোল্লার মতো অতটা স্পাঞ্জি হয় না, তবে খেতে ভীষণ মজার। \n" +
                            "তা ছাড়া এই রসগোল্লার একটা নিজস্ব স্বাদ আছে। \n" +
                            "তাহলে জেনে নিন কীভাবে বানাবেন সুজির রসগোল্লা।\n" +
                            "\n" +
                            "\n" +
                            "উপকরণ :\n" +
                            "১. সুজি ১/২ কাপ\n" +
                            "২. দুধ ১/২ লিটার\n" +
                            "৩. ঘি এক টেবিল চামচ\n" +
                            "৪. চিনি পরিমাণমতো\n" +
                            "৫. এলাচ চারটি\n" +
                            "\n" +
                            "প্রস্তুত প্রণালি :\n" +
                            "প্রথমে চুলায় অল্প আঁচে একটি প্যানে দুধ দিন। \n" +
                            "এরপর দুধের বলক ওঠা পর্যন্ত অপেক্ষা করুন। দুধে বলক চলে এলে এর মধ্যে ঘি এবং দুই টেবিল চামচ চিনি দিয়ে দিন। \n" +
                            "এরপর এগুলো এক মিনিটের মতো নেড়ে নিন। এরপর এর মধ্য দিয়ে দিন সুজি। আর সুজিটা ঢালতে ঢালতে এটা নাড়তে থাকুন।\n" +
                            "\n" +
                            "চুলার আঁচ কমিয়ে দিয়ে এটাকে নাড়তে থাকুন। এরপর যখন এটা একটা ডো-এর মতো হয়ে যাবে, তখন চুলা থেকে নামিয়ে একটা পাত্রে নিয়ে নিন। \n" +
                            "চুলায় একটি হাঁড়িতে দুই কাপ পানিতে এক কাপ চিনি দিয়ে জ্বাল দিন। এরপর এর মধ্যে এলাচগুলো দিয়ে দিন। \n" +
                            "চিনিটা গলে পানিটা ফুটতে শুরু হলে চুলার আঁচ একদম কমিয়ে দিন। হাতে একটু ঘি লাগিয়ে অল্প অল্প করে সুজির ডো নিয়ে মিষ্টির আকার করে নিন।\n" +
                            "\n" +
                            "এরপর মিষ্টিগুলোকে চিনির সিরায় দিয়ে চুলার আঁচ মিডিয়াম করে দিন। একটা ঢাকনা দিয়ে ঢেকে ১০ মিনিট জ্বাল করুন। \n" +
                            "এরপর চুলা থেকে নামিয়ে ঠান্ডা করে পরিবেশন করুন মজাদার সুজির রসগোল্লা।");
                    startActivity(intent);
                }else if (i==5){
                    intent.putExtra("Title","বিকেলের নাস্তায় সুস্বাদু 'চিকেনবল'");
                    intent.putExtra("Description","একটু ভাজাভাজি না হলে বিকেলের নাস্তাটা জমেই না আমাদের। বিকেলে একটু গরম গরম তেলে ভাজা খাবার খেতেই সকলে পছন্দ করে থাকেন। কিন্তু তেলে ভাজা আইটেম খুব বেশি স্বাস্থ্যকর না হওয়ায় গৃহিণীরা বিপদেই পড়ে যান। তাই আজকে চলুন তেলে ভাজা একটু স্বাস্থ্যকর খাবারের খোঁজ করা যাক।\n" +
                            "\n" +
                            "জেনে নিন মুচমুচে চিকেন বল তৈরির রেসিপিটি-\n" +
                            "\n" +
                            "উপকরণঃ\n" +
                            "মুরগির কিমা ১ কে.জি., শুকনো ব্রেড ক্রাম্ব/বিস্কিটের গুঁড়ো ১ কাপ, পেঁয়াজ পাতা ৪ টি, ধনিয়ার গুঁড়ো ১ টেবিল চামচ, ধনে পাতা ১ কাপ, মিষ্টি চিলি সস ১/৪ কাপ, লেবুর রস ২ টেবিল চামচ, লবণ স্বাদমতো, তেল (ভাজার জন্য)।\n" +
                            "\n" +
                            "প্রস্তুত প্রণালীঃ\n" +
                            "একটি বড় বাটিতে মুরগির কিমার সাথে সব উপরকণ ভালোভাবে মিশিয়ে নিন। এবার প্রয়োজনমতো মিশ্রণ নিয়ে হাত দিয়ে মাঝারি আকারের বল বানিয়ে নিন। বল তৈরি করার আগে হাত একটু ভিজিয়ে নিতে পারেন।\n" +
                            "\n" +
                            "একটি ফ্রাইপ্যানে মাঝারি তাপে তেল গরম করে নিন। কয়েকটি করে চিকেন বল নিয়ে ভেজে নিন যতক্ষণ না বাদামি রঙ আসে।\n" +
                            "\n" +
                            "আপনারা চাইলে এই রেসিপিটি বল আকারের না বানিয়ে একটু বড় ও চ্যাপ্টা আকৃতির বানিয়ে বার্গার বানাতে ব্যবহার করতে পারেন।");
                    startActivity(intent);
                }else if (i==6){
                    intent.putExtra("Title","বেগুনের নতুন রেসিপি বেগুন কাবাব");
                    intent.putExtra("Description","সবজির মধ্যে বেগুন সব ঋতুতে পাওয়া যায়। সবজি হিসেবে বেগুন অনেকে বেশ পছন্দ করেন। বেগুন দিয়ে তৈরি করা যায় নানা ধরনের পদ। \n" +
                            "যেমন- বেগুন ভর্তা, বেগুন পোড়া, বেগুনী, বেগুনের সঙ্গে বিভিন্ন ধরনের মাছ দিয়ে রান্না করা যায় পদ।\n" +
                            "\n" +
                            "তবে আজ বেগুনের ভিন্ন স্বাদের নতুন এক পদের রেসিপি দেয়া হল। সেটি হলো বেগুনের কাবাব। \n" +
                            "অনেকেই বিভিন্ন প্রকারের কাবাব খেয়েছে কিন্তু বেগুনের কাবাবের কথা হয়তো অনেকের অজানা। \n" +
                            "এই কাবাব খুব মজাদার।\n" +
                            "\n" +
                            "উপকরণ- বেগুন তিন থেকে চারটি। গরুর কিমা আধা কেজি। দুধ এক পোয়া। পেঁয়াজকুচি এক কাপ। আদা বাটা, গরম মশলা বাটা এক চামচ। \n" +
                            "কাবাব মশলা এক টেবিল চামচ। গোল মরিচ ও শুকনা মরিচের গুঁড়ো এক চামচ। অলিভ অয়েল এক চামচ।\n" +
                            "\n" +
                            "# টমেটো দুই থেকে তিনটা ও টমেটো সস এক চামচ। পাউরুটি দুই পিস, লেবুর রস, গরম পানি ও পরিমাণমতো তেল।\n" +
                            "\n" +
                            "প্রণালি:-\n" +
                            "প্রথমে বেগুনকে ধুয়ে গোল গোল করে কেটে দুই চামচ লবণ পানিতে ভিজিয়ে নিন। এ্খন দুধে পাউরুটি ভিজিয়ে রাখুন নরম করার জন্য। \n" +
                            "এটি গরুর কিমায় মাখালে স্বাদ ভালো হবে। \n" +
                            "তারপর একটি পাত্রে গরুর কিমা, পেঁয়াজ কুচি, আদাবাটা, গরম মশলা বাটা, কাবাব মশলা, লাল শুকনো মরিচের গুঁড়া, গোলমরিচের গুঁড়া, লেবুর রস ও লবণ দিয়ে ভালো করে মিশিয়ে নিন।\n" +
                            "\n" +
                            "এখন নরম পাউরুটি এর সঙ্গে মিশিয়ে নিন। এরপর সব মাখানো হয়ে গেলে কাবাবের মতো চ্যাপ্টা চ্যাপ্টা করে ৩০ মিনিট ফ্রিজে রেখে দিন। \n" +
                            "৩০ মিনিট হয়ে গেলে এখন ওভেনের ট্রেতে দুটি বেগুনের মাঝে একটি করে কাবাব দিয়ে দিন।\n" +
                            "\n" +
                            "এখন কাবাব সস তৈরি করে নিন। টমেটোর সস, গোলমরিচের গুঁড়ো, লবণ এবং এক কাপ গরম পানি মিশিয়ে নিন। \n" +
                            "এর সঙ্গে অলিভ অয়েল দিয়ে দিন। সস বেগুন এবং কাবাবের ওপর ঢেলে দিন। টমেটো টুকরো করে কেটে ট্রেতে রাখা কাবাবের পাশে দিয়ে দিন। \n" +
                            "এখন ওভেনে ২০০ সেলসিয়াস তাপমাত্রা দিয়ে ৪৫ মিনিট টাইম সেট করে বেকিং ট্রেতে রেখে ওভেন চালু করেন। ৪৫ হয়ে গেলে বেক বের করুন।\n" +
                            "\n" +
                            "ব্যস হয়ে গেল মজাদার বেগুন কাবাব। এখন নিজেও খেতে পারেন এবং অতিথিদেরকেও পরিবেশন করতে পারেন।\n");
                    startActivity(intent);
                }else if (i==7){
                    intent.putExtra("Title","মজাদার ও লোভনীয় ব্রাউনির রেসিপি");
                    intent.putExtra("Description","মজাদার ও লোভনীয় সব খাবার খেতে কার না ভালো লাগে। আর সেসব খাবার যদি বাসায় তৈরি করা যায় তাহলে তো আর কথায় নাই। \n" +
                            "তেমনি একটি সুস্বাদু খাবার গরম গরম ব্রাউনি। \n" +
                            "মজাদার ব্রাউনি পরিবেশন করা যায় আইসক্রিমের সঙ্গে। জেনে নিন কীভাবে বানাবেন ব্রাউনি। \n" +
                            "উপকরণ :\n" +
                            "ময়দা- ১/৪ কাপ\n" +
                            "টক দই- ১/৪ কাপ\n" +
                            "বেকিং সোডা- ১/৪ চা চামচ\n" +
                            "চকলেট চিপস- ১ টেবিল চামচ\n" +
                            "তেল- ১/৪ কাপ\n" +
                            "চিনি- স্বাদ মতো\n" +
                            "কোকো পাউডার- ১/৮ কাপ\n" +
                            "ভ্যানিলা এসেন্স- ১/২ চা চামচ   \n" +
                            "\n" +
                            "প্রস্তুত প্রণালি :\n" +
                            "একটি কাচের বড় বাটিতে চিনি ও তেল দিয়ে ভালো করে ফেটান। এবার একে একে ময়দা, বেকিং সোডা, কোকো পাউডার ও চিনি দিয়ে ভালো করে মেশান। \n" +
                            "ভ্যানিলা এসেন্স ও চকলেট চিপস দিয়ে দিন। চাইলে মেল্টেড চকলেটও দিতে পারেন। ১৮০ ডিগ্রী প্রিহিটে দিয়ে দিন মাইক্রোওয়েভ। \n" +
                            "৭-৮ মিনিট পর বেকিং প্যানে মিশ্রণটি নিয়ে দিয়ে দিন ওভেনে। \n" +
                            "উপরে বাদাম কুচি ছিটিয়ে দিতে পারেন। ১৮০ ডিগ্রী সেলসিয়াসে ৩০ থেকে ৩৫ মিনিট বেক করুন।\n" +
                            "\n" +
                            "এবার বাটি বের করে একটি টুথপিক ঢুকিয়ে দেখুন ব্রাউনি নরম হয়েছে কিনা। গরম গরম ব্রাউনি পরিবেশন করুন চকলেট সস অথবা ভ্যানিলা আইসক্রিম দিয়ে।");
                    startActivity(intent);
                }else if (i==8){
                    intent.putExtra("Title","মজাদার প্রন ককটেল সালাদ রেসিপি");
                    intent.putExtra("Description","আমাদের মাঝে এমন অনেকে আছেন যারা নতুন নতুন খাবারের স্বাদ নিতে পছন্দ করেন। \n" +
                            "মাঝে-মধ্যে চেনা জানা খাবারের বাইরে গিয়ে ভিন্ন স্বাদের কিছু খেতে তো মন চায়। \n" +
                            "কিন্তু এসব খাবারের রেসিপি যদি জানা থাকে তবে বাসায় তৈরি করা যায়। \n" +
                            "আর তা বাইরের খাবারের থেকে বেশি স্বাস্থ্যসম্মত হয়। \n" +
                            "তেমনই একটি সুস্বাদু স্ন্যাক্স হলো রিভার প্রন ককটেল সালাদ।\n" +
                            "\n" +
                            "উপকরণ :\n" +
                            "চিংড়ি  ৪টি, মেয়নেজ ১২০ গ্রাম, টমেটো কেচাপ ৮০ গ্রাম, জুলিয়ান কাট লেটুস ১০০ গ্রাম, ব্ল্যাক অলিভ ৬টি, লেবু ১টি, সবজি (শসা, গাজর, টোমাটো, বাঁধাকপি) ১ কাপ, গোলমরিচ এবং লবণ স্বাদমত। \n" +
                            "প্রণালি :\n" +
                            "প্রথমে চিংড়ি লবণ দিয়ে সিদ্ধ করে নিন। এবার ভিন্ন একটি পাত্রে মেয়োনিজ, সাদা গোলমরিচ, টমেটো কেচাপ ও লবণ মিশিয়ে ককটেল সস বানিয়ে সিদ্ধ চিংড়িগুলো দিয়ে দিন।\n" +
                            "\n" +
                            "এবার আরেকটি পাত্রে লেটুস পাতা ও ককটেল সস মেশানো চিংড়ি মাছ, শসা, গাজর,    টোমেটো, বাঁধাকপি লেয়ার করে দিয়ে পরিবেশন করুন মজাদার রিভার প্রন ককটেল সালাদ।");
                    startActivity(intent);
                }else if (i==9){
                    intent.putExtra("Title","মিষ্টি কুমড়ার ফুলের বড়া");
                    intent.putExtra("Description","শীতের দিনে গরম গরম ভাতের সাথে অথবা বিকেলের নাস্তা হিসেবে কুমড়া ফুলের বড়া মজার একটি খাবার। \n" +
                            "খুব সহজ এই রেসিপিটি এবং অল্প সময়ের মধ্যেই প্রস্তুত করা যায়।\n" +
                            "উপকরণ:\n" +
                            "মিষ্টি কুমড়ার ফুল- ১০টি, বেসন- ২ টেবিল চামচ, ময়দা বা চালের গুঁড়া- আধা কাপ, \n" +
                            "কর্নফ্লাওয়ার- ১ টেবিল চামচ, হলুদের গুঁড়া- আধা চা চামচ, মরিচের গুঁড়া- \n" +
                            "পরিমাণমতো, লবণ- স্বাদমতো, পানি- প্রয়োজনমতো, তেল ভাজার জন্য।\n" +
                            "প্রস্তুত প্রণালী:\n" +
                            "মিষ্টি কুমড়ার ফুল ও তেল বাদে বাকি সব উপকরণ একসঙ্গে মেশাতে হবে। পরিমাণমতো পানি দিয়ে ঘন গোলা তৈরি করে নিন। \n" +
                            "এবার ফুলের সবুজ ডাটার কাছ থেকে কেটে ফুলগুলো পরিষ্কার করে ধুয়ে নিতে হবে। চাইলে ফুলের পাপড়ি ভাঁজ করে ফুলের ভেতরে ঢুঁকিয়ে নিতে পারেন।\n" +
                            "\n" +
                            "এবার ফুলগুলো একে একে গোলায় ডুবিয়ে ডুবো তেলে মাঝারি আঁচে ভাজতে হবে। \n" +
                            "হালকা বাদামী রং ধারণ করলে নামিয়ে এনে পছন্দের সসের সঙ্গে গরম গরম পরিবেশন করুন।");
                    startActivity(intent);
                }else if (i==10){
                    intent.putExtra("Title","সকালের নাশতায় সুস্বাদু কিমা পরোটা");
                    intent.putExtra("Description","সকালের নাশতায় গরম গরম পরোটার কোনো জুড়ি নাই। আর তা যদি হয় কিমা পরোটা, তবে তো আর কথা নেই। \n" +
                            "নাশতা হোক বা বিকেলের স্ন্যাকের আয়োজনে, সবসময় খাওয়া যায় এই কিমা পরোটা। \n" +
                            "রেস্তোরাঁর মত মজাদার কিমা পরোটা বাসায় বানিয়ে ফেলুন খুব সহজে। চলুন জেনে নিই কিমা পরোটার রেসিপি –\n" +
                            "\n" +
                            "উপকরণ :\n" +
                            "চিকেন/বিফ কিমা, ঘি, আদাবাটা, আটা, লেবুর রস, দুধ, গোলমরিচ গুঁড়া, কাঁচামরিচ কুচি, পেয়াজ কুচি, লবণ ও তেল পরিমানমত।\n" +
                            "\n" +
                            "বানানোর নিয়ম :\n" +
                            "# প্রথমে একটি পাত্রে পরিমান মত আটা, দুধ, লবণ ও পানি দিয়ে ভালোভাবে ময়ান তৈরী করে রাখুন। ঘন্টা খানেক পরিমান মত তেল দিয়ে মেখে রাখুন।\n" +
                            "\n" +
                            "# এরপর কিমা ধুয়ে পানি ঝরিয়ে আদা বাটা ও লেবুর রস দিয়ে ১-২ ঘন্টা মেরিনেট করে রাখুন।\n" +
                            "\n" +
                            "# চুলায় হাঁড়ি চাপিয়ে পরিমান মত তেলে কাঁচামরিচ কুচি, পেয়াজ কুচি, লবণ, লেবুর রস, গোলমরিচ গুঁড়া ছিটিয়ে কিমা ভাজতে থাকুন। কিমা ভাজা হলে চুলা থেকে নামিয়ে ঠান্ডা করুন।\n" +
                            "\n" +
                            "# এবার ময়ান করা আটা দিয়ে লেচি কেটে রুটি গড়ে নিন। ঐ রুটির ওপর কিমার পুর ছড়িয়ে আরেকখানা রুটি চাপিয়ে হাল্কা বেলে পরোটা তৈরী করুন।\n" +
                            "\n" +
                            "# এরপর ঘি দিয়ে পরোটা এপিঠ ওপিঠ ভালো করে ভেজে গরম গরম পরিবেশন করুন।");
                    startActivity(intent);
                }else if (i==11){
                    intent.putExtra("Title","সহজেই তৈরি করুন রেড ভেলভেট কেক");
                    intent.putExtra("Description","যে কোন উৎসবে আমরা কেক তৈরি করছি। কেকের রং নিয়ে অনেকেই ভাবছি, কিন্ত ফুড কালার যে স্বাস্থ্যকর নয় তা তো সবাই জানি। \n" +
                            "ফুড কালার ব্যবহার না করে উৎসবে যোগ করুন ন্যাচারাল রেড ভেলভেট কেক।\n" +
                            "\n" +
                            "উপকরণ:\n" +
                            "ক্রিম তৈরির জন্য: ক্রিমচিজ ২ কাপ, চিনি ৪ কাপ, মাখন দেড় কাপ, ভ্যানিলা ১ চা-চামচ, দুধ ১ কাপ।\n" +
                            "\n" +
                            "কেক তৈরির জন্য: ময়দা ৪৪০ গ্রাম, দুধ ৫০০ গ্রাম, চিনি ৪০০ গ্রাম, মাখন ১৭০ গ্রাম, ৪৫০ গ্রাম কোকো পাউডার, ২০ গ্রাম ভ্যানিলা এসেন্স, লবণ স্বাদমতো,\n" +
                            " লাল ফুড কালার ৪ টেবিল-চামচ, দই ৩৭০ গ্রাম, ভিনেগার দেড় চা-চামচ, বেকিং সোডা দেড় চা-চামচ, ডিম ৩টি।\n" +
                            "\n" +
                            "প্রস্তুত প্রণালী:\n" +
                            "ক্রিম: সব উপকরণ একসঙ্গে মিশিয়ে ভালোভাবে বিট করতে হবে। এরপর এক টুকরা বরফ মিশিয়ে আবারও ভালোভাবে বিট করে ফ্রিজে রেখে দিন।\n" +
                            "\n" +
                            "রেড ভেলভেট কেক: প্রথমে চিনি, মাখন এবং লবণ একসঙ্গে বিট করে নিতে হবে। অন্য একটি পাত্রে ময়দা, কোকো পাউডার একসঙ্গে মিশিয়ে চালুনিতে চেলে নিতে হবে যেন কোনও দানা না থাকে।\n" +
                            "\n" +
                            "এবার বিট করে রাখা চিনি, মাখন এবং লবণের সঙ্গে ভ্যানিলা এসেন্স, ফুড কালার আর ডিম এক এক করে দিয়ে বার বার বিট করে নিতে হবে। সামান্য পানি দিয়ে দই ফেটে নিন। এরপর দই এবং ময়দা আলাদা করে অল্প অল্প করে দিয়ে বার বার বিট করতে হবে। তাহলে বিট করতে সুবিধা হবে।\n" +
                            "    \n" +
                            "সবশেষে ভিনেগার মিশিয়ে আবারও বিট করুন। এরপর পাত্রে ঢেলে ১৮০ ডিগ্রি তাপমাত্রায় ৩০ মিনিট বেইক করতে হবে। কেক নামিয়ে ঠান্ডা করুন। ঠান্ডা হলে ফ্রিজে রাখা ক্রিম বের করে আরও একবার বিট করে মন মতো করে লেয়ার হিসেবে সাজিয়ে নিলেই তৈরি হয়ে যাবে রেড ভেলভেট কেক।");
                    startActivity(intent);
                }
            }
        });
    }
}
