package com.tinyprojects.friendroid.essentials;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

public class HealthActivity extends AppCompatActivity {
    ListView healthList;
    String [] healthTitle = {"শরীর ফিট রাখতে যা করবেন","যে কারণে ব্রকলি খাবেন","হজমে সমস্যা হলে করণীয়","ক্যাপসিকাম কেন খাবেন","জ্বর হলে যেসব খাবার খাবেন",
            "যে কারণে স্বাস্থ্যকর খাবার বেশি খাবেন না","রসুনের ব্যতিক্রমী ব্যবহার","খাঁটি মধু চেনার সহজ কিছু উপায়","উচ্চ রক্তচাপ হলে যা খাবেন না","কিডনি সুস্থ রাখবে যেসব খাবার ",
            "মটরশুটি কেন খাবেন","পিরিয়ডের সময় কিছু করণীয়", "লাল আলু খাবেন যে কারণে","সুস্থ থাকতে টিটক্স",
            "পান্তা ভাত কেন খাবেন","ওজন কমাবে যে প্রোটিন","সিগারেট ছাড়তে চাইলে যা খাবেন"};

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_health);
        healthList = findViewById(R.id.healthList);
        ChildListAdapter listAdapter = new ChildListAdapter(this,healthTitle);
        healthList.setAdapter(listAdapter);
        healthList.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            Intent intent = new Intent(HealthActivity.this,ReadingActivity.class);
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {

                if (i==0){
                    intent.putExtra("Title","শরীর ফিট রাখতে যা করবেন");
                    intent.putExtra("Description","শরীর ফিট রাখতে চাইলে ঝরিয়ে ফেলতে মেদ। শরীরে জমে থাকা বাড়তি মেদ ঝরাতে পোড়াতে হবে ক্যালোরি। যত ক্যালোরি বাড়তি খাচ্ছেন প্রতিদিন, ততখানি ঝরিয়ে ফেলতে পারলেই বাড়বে না ওজন। আর একটু বেশি ঝরাতে পারলেই ওজন কমতে শুরু করবে। দৈনন্দিন জীবনের ফাঁকেই একটু বুদ্ধি করলে ঝরিয়ে ফেলতে পারবেন বাড়তি মেদ। চলুন জেনে নেয়া যাক কীভাবে আমাদের ওজন নিয়ন্ত্রিত করতে পারি।\n" +
                            "\n" +
                            "*নিজের কাজগুলো নিজেই করুন রোজ। যেমন কাপড় ধোয়া, ঘর পরিষ্কার করা ইত্যাদি।\n" +
                            "\n" +
                            "*লিফটকে ‘না’ বলে সিঁড়ি বেঁয়ে উপরে উঠুন।\n" +
                            "\n" +
                            "*একটু স্পাইসি খাবার খান। মসলা মেটাবোলিজম বাড়ায় ও ক্যালোরি পোড়াতে সহায়তা করে।\n" +
                            "\n" +
                            "*খাবার খান সময় নিয়ে, ভালোমতো চিবিয়ে খান।\n" +
                            "\n" +
                            "*কোমল পানীয় পান করা একেবারেই বাদ দিন।\n" +
                            "\n" +
                            "*প্রতি বেলায় খাবারের সঙ্গে সালাদ খান।\n" +
                            "\n" +
                            "*দৈনিক মিনিট দশেক দড়ি দিয়ে ব্যায়াম করুন অর্থাৎ স্কিপিং করুন।\n" +
                            "\n" +
                            "*চিনি খাওয়ার অভ্যাস বাদ দিয়ে দিন।\n" +
                            "\n" +
                            "*মাছ খাওয়ার অভ্যাস গড়ে তুলুন।\n" +
                            "\n" +
                            "*স্ট্রেসমুক্ত জীবনযাপন করুন।");
                    startActivity(intent);
                }else if (i==1){
                    intent.putExtra("Title","যে কারণে ব্রকলি খাবেন");
                    intent.putExtra("Description","অনেকটা ফুলকপির মতোই দেখতে সবুজ রঙের সবিজিটির নাম ব্রকলি। দিনে দিনে এটি বেশ পরিচিত হয়েছে আমাদের দেশে। চাইনিজ জাতীয় খাবারে ব্যবহৃত অন্যতম প্রধান উপকরণ এই সবজি। দেশেও চাষ হচ্ছে ব্রকলির। কাঁচা কিংবা রান্না করে, ব্রকলি খাওয়া যায় দুইভাবেই। চলুন জেনে নেই ব্রকলির পুষ্টিগুণ।\n" +
                            "\n" +
                            "ব্রকলিকে শক্তিশালী ক্যান্সার বিরোধী খাদ্য। এতে থাকে খনিজ, অ্যান্টিঅক্সিডেন্ট।\n" +
                            "\n" +
                            "ক্ষতিগ্রস্ত ত্বকের টিস্যু মেরামত করে এবং ত্বক উন্নত করতে ব্রকলিতে থাকা গ্লুকোরাফানিন বৈশিষ্ট্য অনন্য।\n" +
                            "\n" +
                            "ব্রকলিতে প্রচুর পরিমাণে ফ্ল্যাভোনয়েড, লিউটেনের সঙ্গে ক্যারটিনয়েড, বিটা-ক্যারোটিন এবং জিক্সানথিন- সব শক্তিশালী অ্যান্টিঅক্সিডেন্ট আছে যা অনেক গুরুতর রোগ প্রতিরোধ করে।\n" +
                            "\n" +
                            "ব্রকলি পটাসিয়াম এবং ম্যাগনেসিয়াম সমৃদ্ধ। সুস্থ স্নায়ুতন্ত্রের যা অত্যন্ত গুরুত্বপূর্ণ। এতে ক্যালসিয়ামের আধিক্য থাকায় হাড়ের জন্য এটি বেশ উপকারী।\n" +
                            "\n" +
                            "রক্তের শর্করা নিয়ন্ত্রণে আনে ব্রকলি। এটি চিনির প্রভাব রোধ করে ও রক্তে শর্করার মাত্রা কম রাখে। ব্রকলি ফাইবার সমৃদ্ধ।\n" +
                            "\n" +
                            "মানসিক চাপ কমাতে ব্রকলি খাওয়া যেতে পারে নিয়মিত। ব্রকলি স্প্রাউটসের জুস পান করলে শরীরে এক ধরনের কেমিক্যাল তৈরি হয় যা বায়ুদূষণ থেকে তৈরি কিছু ঝুঁকি কমিয়ে দিতে সাহায্য করে।\n" +
                            "\n" +
                            "ব্রকলিতে প্রচুর পরিমাণে দ্রবণীয় ফাইবার থাকে। যা শরীর থেকে কোলেস্টেরল বের করে দেয়।");
                    startActivity(intent);
                }else if (i==2){
                    intent.putExtra("Title","হজমে সমস্যা হলে করণীয়");
                    intent.putExtra("Description","খাবার ঠিকভাবে হজম না হলে তার প্রভাব পড়ে আমাদের শরীরে। নানা কারণেই হতে পারে হজমের সমস্যা। অনিয়মিত খাওয়াদাওয়া এর অন্যতম কারণ। বদহজম, অ্যাসিডিটি, পেটে অতিরিক্ত গ্যাস, ঢেকুর ও বাতাস নির্গমনের মতো বিরক্তিকর সমস্যা থেকে রেহাই পেতে মেনে চলুন কিছু করণীয়-\n" +
                            "\n" +
                            "কোষ্ঠকাঠিন্য হলে পেট ফাঁপে। তাই কোষ্ঠকাঠিন্য এড়াতে আঁশযুক্ত খাবার খান, পর্যাপ্ত পানি পান করুন।\n" +
                            "\n" +
                            "খাওয়ার সময় ও মাঝখানে বেশি পানি পান করলে পাকস্থলীর অ্যাসিড দুর্বল হয়ে পড়ে এবং ভালো করে খাবার ভাঙতে পারে না। তাই খাওয়ার অন্তত ৩০ মিনিট আগে এক গ্লাস পানি পান করুন। খাওয়ার সময় বেশি পানি নয়। খাওয়া শেষে আবার একটু সময় পর পানি পান করবেন।\n" +
                            "\n" +
                            "খাওয়ার সময় তাড়াহুড়া করবেন না। সময় নিয়ে, ধীরে-সুস্থে ভালো করে চিবিয়ে খাওয়া শেষ করবেন। তাড়াহুড়া করে খেতে গিয়ে খাবার ঠিকমতো হজম হয় না। তা ছাড়া পেটে খানিকটা বাতাসও ঢুকে যায়।\n" +
                            "\n" +
                            "একেকজনের একেক ধরনের খাবার হজম করতে সমস্যা হয়। যাদের ল্যাকটোজ ইনটলারেন্স আছে, তারা দুধ ও দুধের তৈরি খাবার খেতে পারেন না। অনেকের মিষ্টিজাতীয় দ্রব্যে সমস্যা হয়। কারও সমস্যা হয় রুটি, যব বা ডালজাতীয় খাবারে। কার কোনটাতে সমস্যা, সেটা তিনিই ভালো ধরতে পারবেন। তাই বদহজমের রোগীর দুধ নিষেধ বা মিষ্টি নিষেধ-এ জাতীয় কথা ঢালাওভাবে বলা যায় না।\n" +
                            "\n" +
                            "পেটে গ্যাস সমস্যা তৈরি করতে পারে কৃত্রিম চিনি, অতিরিক্ত তেল-চর্বিযুক্ত খাবারও। তাই এগুলো খেতে হবে হিসাব করে।\n" +
                            "\n" +
                            "ধূমপান, চুইংগাম চিবোনো ও স্ট্র দিয়ে জুসজাতীয় কিছু খেলে পেটে গ্যাস হওয়ার প্রবণতা বাড়ে। তাই এ ধরনের অভ্যাস বর্জন করুন।");
                    startActivity(intent);
                }else if (i==3){
                    intent.putExtra("Title","ক্যাপসিকাম কেন খাবেন");
                    intent.putExtra("Description","ক্যাপসিকামের রয়েছে নানা উপকারিতা। আপনার প্রতিদিনের খাদ্যতালিকায় একটি করে ক্যাপসিকাম রাখলে পেতে পারেন অনেকরকম অসুখ থেকে মুক্তি। চলুন জেনে নেই ক্যাপসিকামের কিছু উপকারিতা-\n" +
                            "\n" +
                            "ক্যাপসিকামের ভিটামিন সি এবং কে দেহের সার্বিক উন্নয়নে কাজ করে। এতে করে রোগ প্রতিরোধ ক্ষমতা বৃদ্ধি পায় অনেকাংশে, যার ফলে ছোটোখাটো নানা রোগ থেকে মুক্ত থাকা সম্ভব হয়।\n" +
                            "\n" +
                            "ক্যাপসিকামে রয়েছে প্রচুর পরিমাণে ভিটামিন সি। ভিটামিন সি দেহে আয়রন শোষণে সহায়তা করে। এতে দেহে আয়রনের অভাব জনিত সমস্যা দূর হয়। এতে রয়েছে প্রচুর পরিমাণে ভিটামিন এ, সি এবং বেটা ক্যারোটিন যা দৃষ্টিশক্তি সংক্রান্ত নানা সমস্যা দূর করে এবং দৃষ্টিশক্তি উন্নত করতে সাহায্য করে।\n" +
                            "\n" +
                            "ক্যাপসিকামের অ্যাক্টিভেটিং থার্মোজেনেসিস এবং হজম শক্তি উন্নত করার ক্ষমতা দ্রুত ওজন কমাতে সহায়ক।\n" +
                            "\n" +
                            "ক্যাপসিকামের অ্যান্টিঅক্সিডেন্ট ও অ্যান্টি ইনফ্লেমেটরি উপাদান ক্যান্সার প্রতিরোধ করতে বিশেষভাবে সহায়ক। ক্যাপসিকামে রয়েছে সালফার কম্পাউন্ড যা গ্যাস্ট্রিক ক্যান্সার এবং এসোফেগাল ক্যান্সার প্রতিরোধ করার ক্ষমতা রাখে।\n" +
                            "\n" +
                            "ক্যাপসিকামে রয়েছে লাইকোপেন না কার্ডিওভ্যস্কুলার নানা সমস্যা দূর করতে সহায়তা করে এবং হৃদপিণ্ড সুস্থ রাখে। উচ্চ রক্তচাপের সমস্যা নিয়ন্ত্রণে রাখতেও বিশেষভাবে সহায়ক ক্যাপসিকাম। এর ক্যাপসাইসিন উচ্চ রক্ত চাপের সমস্যা নিয়ন্ত্রণে রাখতে সহায়তা করে।\n" +
                            "\n" +
                            "পরীক্ষায় দেখা গিয়েছে ক্যাপসিকামের জুস হজম সংক্রান্ত নানা সমস্যা ও পেটের পীড়াজনিত রোগ যেমন গ্যাস হওয়া, ডায়রিয়া, ডিসপেপসিয়া ইত্যাদি দূর করতে সহায়তা করে।");
                    startActivity(intent);
                }else if (i==4){
                    intent.putExtra("Title","জ্বর হলে যেসব খাবার খাবেন");
                    intent.putExtra("Description","জ্বর হলে মুখে আর কোনোকিছুই যেন রোচে না। তখন মধুকেও যেন চিরতার রস মনে হয়। স্বাভাবিক সব খাবার বন্ধ করে তখন খেতে হয় পথ্য ধরনের খাবার। মুখে না রুচলেও একপ্রকার জোর করেই খেতে হয়। তবে এমনকিছু খাওয়া উচিত যা শরীরে শক্তি যোগানোর পাশাপাশি জ্বর সারাতে সাহায্য করবে। চলুন জেনে নেই এমনই কিছু খাবারের কথা।\n" +
                            "\n" +
                            "আদা দিয়ে গলানো ভাত খুব একটা উপাদেয় নয় কিন্তু ফ্লু-এর ক্ষেত্রে শরীরের জন্য বেশ উপকারী। ভাতটা গলা গলা  থাকলে ভালো।\n" +
                            "\n" +
                            "আপেল, কমলালেবু, আঙুর, আনারস ইত্যদি ফলে ভিটামিন সি এবং ভিটামিন এ রয়েছে। তাই জ্বরের সময় ফ্রুট সালাদ খাওয়া উচিত বেশি করে।\n" +
                            "\n" +
                            "যে কোনও নরম খাবার যেমন সবজি, ডিমসেদ্ধ ইত্যাদি খাবার হজম হতে সুবিধে হয়। ভাত চটকে খাওয়া যাদের পছন্দ নয় তারা এই খাবারগুলি খেতে পারেন। এগুলি পুষ্টিগুণেও ভরপুর।\n" +
                            "\n" +
                            "আদার মতোই রসুনও সর্দিজ্বর নিরাময়ে খুবই কার্যকরী। এককাপ মতো পানিতে একটি কোয়া ফেলে ফুটিয়ে নিয়ে সেই ইষদুষ্ণ পানি দিনে দুইবার খেলে জ্বর কমাতে সাহায্য করে।\n" +
                            "\n" +
                            "জ্বরের সময় মাঝেমধ্যেই একটি-দুটি করে কিসমিস খাওয়া ভালো কারণ এতে রয়েছে প্রচুর অ্যান্টিঅক্সিড্যান্ট। তাছাড়া শরীরে এনার্জি সরবরাহ করে এই ড্রাই ফ্রুট।\n" +
                            "\n" +
                            "দিনে দুইবার কমলালেবুর রস খেলে উপকার পাবেন।\n" +
                            "\n" +
                            "সর্দি-কাশি প্রতিরোধে পরিচিত টোটকা তুলসি-মধু। জ্বর হলে একটি-দু’টি পাতা চিবিয়ে খেলেও উপকার হবে।\n");
                    startActivity(intent);
                }else if (i==5){
                    intent.putExtra("Title","যে কারণে স্বাস্থ্যকর খাবার বেশি খাবেন না");
                    intent.putExtra("Description","সুস্থতার জন্য পুষ্টিকর খাবার খেতে পরামর্শ দেন বিশেষজ্ঞরা। আদর্শ ডায়েটে প্রোটিন, ফল, শাক-সব্জি, বাদাম রাখার কথা বলেন তারা। সেই সঙ্গেই প্রয়োজন পর্যাপ্ত পানি। তবে এই খাবারগুলোই বেশি পরিমাণে খেলে হতে পারে হিতে বিপরীত।\n" +
                            "\n" +
                            "প্রচুর পরিমাণ ভিটামিন, মিনারেল, ফাইবার, অ্যান্টিঅক্সিড্যান্ট থাকায় ফল সুস্থ থাকার জন্য অত্যন্ত জরুরি। তবে একমাত্র পরিমিত পরিমাণ খেলেই। কলা, খেজুর, আনারস, আম, আঙুরের মতো হাই গ্লাইসেমিক ইনডেক্সযুক্ত ফল বেশি খেলে টাইপ টু ডায়াবেটিসে আক্রান্ত হওয়ার ঝুঁকি বাড়ে।\n" +
                            "\n" +
                            "হাই প্রোটিন ও স্বাস্থ্যকর ফ্যাট থাকার কারণে বাদাম অন্যতম পুষ্টিকর খাবার। কিন্তু প্যাকেজড বাদাম বেশি খেলে বিপদ। অতিরিক্ত সোডিয়াম থাকার কারণে তা শরীরের পক্ষে ক্ষতিকারক হতে পারে। আমন্ড, আখোরট, কিসমিস, পেস্তা মিশিয়ে একমুঠো বাদামই রোজ যথেষ্ট।\n" +
                            "\n" +
                            "শরীরের কোষ, কলা ও হরমোন তৈরির জন্য প্রোটিন সবচেয়ে প্রয়োজনীয়। অতিরিক্ত প্রোটিন খেলে পৌষ্টিকতন্ত্র ও কিডনির ওপর চাপ পড়ে। ফলে রক্তে নাইট্রোজেন বর্জ্য জমা হতে থাকে।\n" +
                            "\n" +
                            "সুস্থ থাকার জন্য পর্যাপ্ত হাইড্রেশন জরুরি। কিন্তু অতিরিক্ত পানি খেলে শরীরে সোডিয়ামের ঘনত্ব কমে যায়। কোষের কার্যকারিতাও বাধা পায়। মস্তিষ্কে প্রদাহ হতে পারে।");
                    startActivity(intent);
                }else if (i==6){
                    intent.putExtra("Title","রসুনের ব্যতিক্রমী ব্যবহার");
                    intent.putExtra("Description","রসুন ছাড়া অনেক মজাদার খাবারই তৈরি করা যায় না। খাবারের স্বাদ, গন্ধ আর পুষ্টিমান বাড়াতে রসুনের জুড়ি নেই। কিন্তু রান্না ছাড়াও আরো অনেক কাজে ব্যবহার করা যায় রসুন। চলুন জেনে নেয়া যাক, রসুনের কয়েকটি ব্যতিক্রমী ব্যবহার-\n" +
                            "\n" +
                            "১. দ্রুত ব্রণ সারাতে বা ব্রণের ব্যথা কমাতে আক্রান্ত স্থানে কাঁচা রসুন বা কাঁচা রসুনের রস লাগান। দ্রুত নিরাময় হবে।\n" +
                            "২. রাতে জ্বর হতে থাকলে ঠোঁটের কোণে জ্বর ঠোসা অনেকেরই হয়। আর এতে মারাত্মক ব্যথাও হয়। জ্বর ঠোসা সারাতে কাঁচা রসুনের রস আক্রান্ত স্থানে লাগান। ব্যথা কমবে আর সেরেও যাবে দ্রুত।\n" +
                            "\n" +
                            "৩. সারাদিন জুতো পরে থাকার পর অনেকেরই পায়ে চুলকানি হয়। এটা সারাতে উষ্ণ পানিতে রসুন ও সামান্য লবণ দিয়ে পা ভিজিয়ে রাখুন আধা ঘণ্টা। তারপর সাবান ও সাধারণ পানি দিয়ে ধুয়ে নিন।\n" +
                            "৪. ত্বকের যে কোন সমস্যা যেমন ফোঁড়া বা ইনফেকশন ইত্যাদি রসুন খুবই সহায়ক। কেবল আক্রান্ত সাথে কাঁচা রসুনের রস লাগালেই হবে। ১০/১৫ মিনিট রেখে ধুয়ে ফেলবেন।\n" +
                            "\n" +
                            "৫. দ্রুত গলা ব্যথা নিরাময় করতে এক কোয়া কাঁচা রসুন চুষে চুষে খেয়ে নিন। গন্ধ ভালো না লাগলে এরপর দুধ খেয়ে নিন এক গ্লাস। কাঁচা রসুনের রস এভাবে আস্তে আস্তে খেলে তা গলা ব্যথায় খুবই উপকারী।\n" +
                            "৬. হাইপারটেনশনের সমস্যা নিরাময়ে রোজ সকালে খালি পেটে কয়েক কোয়া থেঁতো রসুন খেয়ে নিন।\n" +
                            "\n" +
                            "৭. মাছ ধরতে খুব ভালোবাসেন? বেশি মাছ ধরার জন্য টোপের মাঝে দিয়ে দিন কাঁচা রসুন। লোভে লোভে প্রচুর মাছ উপস্থিত হবে।\n" +
                            "৮. মাথায় নতুন চুল গজাতে আক্রান্ত স্থানে নিয়মিত রসুন ঘষুন। সারা রাত রেখে সকালে ধুয়ে ফেলুন। কিছুদিনের মাঝেই নতুন চুল গজাবে।\n" +
                            "\n" +
                            "৯. রসুন ধরার পর লক্ষ করেছেন যে হাত কেমন আঠা আঠা হয়ে যায়? কাগজ সহ ছোট খাটো অনেক কাজেই আপনি আঠা হিসাবে ব্যবহার করতে পারেন রসুন।\n" +
                            "১০. পোকামাকড়ের হাত থেকে গাছ রক্ষায় রসুন দারুণ উপকারী। মিহি থেঁতো করা কাঁচা রসুন, পানি ও সামান্য তরল সাবান একসাথে মিশিয়ে স্প্রে বোতলে ভরে রাখুন। এটা কিছুদিন পর পর গাছে স্প্রে করুন পোকামাকড় দূরে রাখতে।");
                    startActivity(intent);
                }else if (i==7){
                    intent.putExtra("Title","খাঁটি মধু চেনার সহজ কিছু উপায়");
                    intent.putExtra("Description","মধু কিনতে গেলে কমবেশি সবাই বিপাকে পড়ে যান। কারণ নকল মধুতে বাজার সয়লাব। সব মধুর চেহারা একই রকম হওয়ায় বোঝা দায় কোনটি আসল, কোনটি নকল। খাটি মধু চেনার উপায় জানতে হলে আপনার কিছু কৌশল জানা প্রয়োজন, খুব সহজেই চিনতে পোরেন আসল মধু। তবে আসল মধু চেনার আগে চিনতে হবে নকল মধু।\n" +
                            "\n" +
                            "এক গ্লাস পানিতে এক চামচ পরিমাণ মধু দিন। তারপর আস্তে আস্তে গ্লাসটি নাড়া দিন। মধু পানির সঙ্গে মিশে গেলে নিশ্চিত হবেন সেটা ভেজাল মধু। আর মধু যদি ছোট পিণ্ডের মতো গ্লাসের পানিতে ছড়িয়ে যায়, তাহলে বুঝবেন সেটা খাটি মধু।\n" +
                            "\n" +
                            "নকল মধুতে ফেনা হয়। এছাড়া একটু টকটক গন্ধ থাকবে এবং গন্ধ তেমন ভালো হয় না।\n" +
                            "\n" +
                            "নকল মধু বেশ পাতলা হয়। স্তরগুলো আলাদা করা যায়। এছাড়া খেতে সুস্বাদু হয় না। এছাড়া তলানিটা খসখসে থাকে।\n" +
                            "\n" +
                            "সামান্য মধু আঙ্গুলে নিন, এর পুরুত্ব দেখুন। আসল মধু অনেক বেশি আঠালো হবে।\n" +
                            "\n" +
                            "খাঁটি মধু ড্রপ অবস্থায়ই গ্লাসের নিচে চলে যাবে। তারপর আস্তে আস্তে গ্লাসটি নাড়া দিন। মধু পানির সঙ্গে মিশে গেলে নিশ্চিত হবেন সেটা ভেজাল মধু। আর মধু যদি ছোট পিণ্ডের মতো গ্লাসের পানিতে ছড়িয়ে যায়, তাহলে বুঝবেন সেটা খাঁটি মধু।\n" +
                            "\n" +
                            "মধু যদি নকল না হয় তবে দীর্ঘদিন থাকলেও মধুর নিচে জমাট বাঁধবে না।এছাড়া পিঁপড়া ধরবে না।");
                    startActivity(intent);
                }else if (i==8){
                    intent.putExtra("Title","উচ্চ রক্তচাপ হলে যা খাবেন না");
                    intent.putExtra("Description","উচ্চ রক্তচাপে আক্রান্ত মানুষের একটি স্বাস্থ্যকর খাদ্যতালিকা অনুসরণ করা প্রয়োজন। নির্দিষ্ট খাবার রক্তচাপ নিয়ন্ত্রণ করে। ভিটামিন সি ভোজনে উচ্চ রক্তচাপের সম্ভাবনা কমিয়ে দেয়। যেমন কমলা, কিউই, ক্র্যানবেরি, পেয়ারা, আঙ্গুর এবং স্ট্রবেরি ফলের ভিটামিন সি সমৃদ্ধ স্বাস্থ্যকর খাবার রক্তচাপ স্বাভাবিকভাবেই কমিয়ে থাকে। কিছু খাবার আছে যা উচ্চ রক্তচাপ ব্যক্তিদের এড়িয়ে চলা উচিত।\n" +
                            "\n" +
                            "প্রক্রিয়াজাত মাংসে সোডিয়ামের মাত্রা বেশি থাকে আর তাই আপনার রক্ত চাপ বাড়িয়ে দিতে পারে। আপনার খাদ্যে এই ধরণের প্রক্রিয়াজাত খাবার এড়িয়ে চলুন।\n" +
                            "\n" +
                            "টিনজাত খাবার লবণ দিয়ে সংরক্ষিত করা হয় এবং এতে সোডিয়ামের মাত্রা বেশি থাকে। টিনজাত খাবার, স্যুপ ঝোল এবং স্টক খুব খারাপ হতে পারে। জৈব খাদ্য যাতে কম সোডিয়াম আছে এমন খাবার বেছে নিন। \n" +
                            "\n" +
                            "লবণ উচ্চ রক্তচাপ ও হৃদরোগ আক্রান্ত মানুষের জন্য খুবই খারাপ। আমেরিকানদের খাদ্যতালিকাগত নির্দেশিকা অনুযায়ী, উচ্চ রক্তচাপ বা প্রি-হাইপারটেনশন ব্যক্তিদের সোডিয়াম ভোজন সীমিত করা উচিত। আপনার খাদ্যে অতিরিক্ত লবন যোগ এড়িয়ে চলুন।\n" +
                            "\n" +
                            "লবণ ক্যানিং এবং লম্বা সময়ের জন্য সংরক্ষণের জন্য আচারে সংযোজন করা হয়। আপনি যদি উচ্চ রক্তচাপে ভোগেন, তাহলে খাদ্য তালিকা থেকে আচার বাদ দিয়ে দিন।\n" +
                            "\n" +
                            "অত্যধিক চিনি খাওয়া শুধু ডায়াবেটিস ও স্থূলতার সম্ভাবনা বৃদ্ধি করে তাই নয়, এটি আপনার রক্ত চাপ ও বাড়িয়ে দেয়। তাছাড়া, উচ্চ রক্তচাপ মাত্রাতিরিক্ত ওজনের এবং মোটা মানুষের মধ্যে বেশি প্রচলিত। সুতরাং, চিনি-যুক্ত খাবার এড়িয়ে চলুন।\n" +
                            "\n" +
                            "গবেষকদের মতে, এক সঙ্গে তিন গ্লাস অ্যালকোহল পানে অস্থায়ীভাবে উচ্চ রক্তচাপের মাত্রা বাড়াতে পারে। তাছাড়া, অ্যালকোহল উচ্চ রক্তচাপ নিয়ন্ত্রণের ওষুধগুলো প্রভাবিত করে।\n" +
                            "\n" +
                            "মাংস নয় তবে মুরগীর চামড়ায় চর্বির মাত্রা বেশি থাকে যা রক্তচাপ প্রভাবিত করে। লাল মাংস এবং মাখন চর্বিতে পরিপূর্ণ যা রক্ত চাপ রোগীদের জন্য ক্ষতিকর হতে পারে।\n" +
                            "\n" +
                            "কফি বা ক্যাফেইনে যদি আসক্ত হন, তাহলে এই পানীয়কে বিদায় বলার সময় হয়েছে। কফি অস্থায়ীভাবে রক্তচাপ বাড়িয়ে তোলে। ");
                    startActivity(intent);
                }else if (i==9){
                    intent.putExtra("Title","কিডনি সুস্থ রাখবে যেসব খাবার ");
                    intent.putExtra("Description","কিডনি সুস্থ রাখতে খাবারতালিকায় পরিবর্তন আনা জরুরি। গবেষণায় দেখা গেছে কিছু খাবার নিয়মিত খেলে শরীরে এমন কিছু উপাদানের মাত্রা বাড়তে শুরু করে, যা কিডনির কোনো ধরনের ক্ষতি হওয়ার আশঙ্কা তো কমায়ই, সেই সঙ্গে কিডনি ফাংশেনর এত মাত্রায় উন্নতি ঘটায় যে রোগভোগের আশঙ্কা একেবারে কমে যায়। যেসব খাবার কিডনি ফাংশন বাড়াতে বিশেষ ভূমিকা পালন করে থাকে সেগুলো হলো-\n" +
                            "\n" +
                            "দারুচিনি : \n" +
                            "রক্তে শর্করার মাত্রা যাতে কোনোভাবে বৃদ্ধি না পায় সেদিকে খেয়াল রাখে এই প্রকৃতিক উপাদানটি। সেই সঙ্গে কিডনি ফাংশনারেও উন্নতি ঘটায়।\n" +
                            "\n" +
                            "চেরি : \n" +
                            "এই ফলটিতে উপস্থিত ভিটামিন সি, ভিটামিন কে, ফলেট, ভিটামিন বি৬ ও ম্যাগনেসিয়াম শরীরে প্রবেশ করার পর কিডনি ফাংশানের মারাত্মক উন্নতি ঘটায়। ফলে স্বাভাবিক ভাবেই রক্তে ইউরিক অ্যাসিডের মাত্রা কমাতে শুরু করে। আর যত ইউরিক অ্যাসিডের মাত্রা কমে, তত অর্থ্রাটিসের মতো রোগে আক্রান্ত হওয়ার আশঙ্কাও হ্রাস পায়।\n" +
                            "\n" +
                            "ক্র্যানবেরি : \n" +
                            "চেরির মতো এই ফলটিতেও রয়েছে প্রচুর মাত্রায় ভিটামিন সি ও ম্যাগনেসিয়াম। আর যেমনটা ইতিমধ্যেই জেনে ফেলেছেন যে এই দুটি উপাদান কিডনির ক্ষমতা বাড়াতে বিশেষ ভূমিকা পালন করে থাকে।\n" +
                            "\n" +
                            "অলিভ অয়েল : \n" +
                            "সম্প্রতি প্রকাশিত একটি গবেষণা পত্র অনুসারে এই তেলটির অন্দরে উপস্থিত নানাবিধ আনস্যাচুরেটেড ফ্যাট ও ওমেগা থ্রি ফ্যাটি অ্যাসিড কিডনি ফাংশনের উন্নতি ঘটাতে বিশেষ ভূমিকা পালন করে থাকে।\n" +
                            "\n" +
                            "পেঁয়াজ ও রসুন : \n" +
                            "কিডনির ক্ষমতা বাড়াতে এই দুটি সবজি বিশেষ ভূমিকা পালন করে থাকে। আসলে পিঁয়াজ এবং রসুনের মধ্যে কুয়েরসেটিন নামক একটি উপাদান থাকে, যা কিডনিকে নানাবিধ ক্ষতিকর উপাদানের হাত থেকে রক্ষা করে।\n" +
                            "\n" +
                            "বাদাম : \n" +
                            "আয়ুর্বেদ শাস্ত্র মতে কিডনি স্টোনের আশঙ্কা কমানোর পাশাপাশি শরীরের এই গুরুত্বপূর্ণ অঙ্গটির কর্মক্ষমতা বাড়াতেও বাদামজাতীয় খাবার। বিশেষত কিডনি বিনস বিশেষ ভূমিকা পালন করে থাকে।");
                    startActivity(intent);
                }else if (i==10){
                    intent.putExtra("Title","মটরশুটি কেন খাবেন");
                    intent.putExtra("Description","মটরশুটিতে প্রচুর পরিমাণে প্রোটিন, আঁশ এবং অনেক ধরনের পুষ্টিসমৃদ্ধ উপাদান রয়েছে। এতে ফ্যাট কম থাকায় এটি ওজন কমাতে সাহায্য করে। মটরশুটিতে প্রচুর পরিমাণে পলিফেনল আছে। গবেষণায় দেখা গেছে, কেউ যদি প্রতিদিন ২ মিলিগ্রাম পলিফেলনসমৃদ্ধ খাবার খান তাহলে তার পাকস্থলী ক্যানসারের ঝুঁকি অনেকটাই কমে যায়। আর এক কাপ মটরশুটিতে অন্তত ১০ মিলিগ্রাম পলিফেলন থাকে। তাই এটি পাকস্থলী ক্যানসারের ঝুঁকি কমাতে দারুণ কার্যকরী।\n" +
                            "\n" +
                            "প্রচুর পরিমাণে এন্টিঅক্সিডেন্ট থাকায় মটরশুটি বয়স ধরে রাখতে সাহায্য করে, শরীরে রোগ প্রতিরোধ ক্ষমতা এবং প্রাণশক্তি বাড়ায়। এটি রক্তে শর্করার মাত্রা নিয়ন্ত্রণেও সহায়তা করে। একারণে ডায়বেটিস রোগীদের জন্যও এটি বেশ উপকারী।\n" +
                            "\n" +
                            "ভিটামিন বি১,২,৩,৬ এর উৎস হওয়ায় এটি শরীরের হোমোসাইস্টাইন লেভেল কমায়, একারণে শরীরে হৃদরোগের ঝুঁকিও কমে । প্রচুর পরিমাণে আঁশ থাকায় মটরশুটি কোষ্ঠকাঠিন্য সারাতে সাহায্য করে।\n" +
                            "\n" +
                            "এক কাপ পরিমাণ মটরশুটিতে প্রচুর পরিমাণে ভিটামিন কে থাকে যা শরীরে ক্যালসিয়ামের ঘাটতি পূরণে সাহায্য করে। ফলে হাড় মজবুত রাখার ক্ষেত্রেও মটরশুটি বেশ কার্যকরী। এছাড়া শরীরে খারাপ কোলেষ্টেরলের মাত্রা নিয়ন্ত্রণেও দারুণ ভূমিকা রাখে মটরশুটি।\n" +
                            "\n" +
                            "মটরশুটি খুব পুষ্টিকর খাদ্য। এই সবজিতে বেশ ভালো পরিমাণে তন্তু থাকায় পেট পরিস্কার রাখে ও কোষ্ঠকাঠিন্য রোধ করে।\n" +
                            "\n" +
                            "মটরশুটি রক্তে কোলেস্টেরলের মাত্রা কমায়। অ্যান্টি অক্সিডেন্ট হিসেবে এই সবজি দারুণ কাজ করে ও শিশুদের রোগ প্রতিরোধ ক্ষমতা বাড়ায়।\n" +
                            "\n" +
                            "ডায়াবেটিক রোগীরা মটরশুটি খেতে পারেন। এছাড়া এটি শরীরে হাড় শক্ত করতেও খুব ভালো। ফলিক অ্যাসিড থাকায় প্রসূতি মায়েরা মটরশুটি খেতে পারেন।\n" +
                            "\n" +
                            "এতে থাকে প্রচুর আয়রন। যা অ্যানিমিয়া ও ক্লান্তি দূর করতে সাহায্য করে।\n" +
                            "\n" +
                            "প্রোটিন, ভিটামিন ও অ্যান্টিঅক্সিডেন্টে সমৃদ্ধ হওয়ায় শিশুর দেহের বৃদ্ধিতে দারুণ কাজ করে মটরশুঁটি।");
                    startActivity(intent);
                }else if (i==11){
                    intent.putExtra("Title","পিরিয়ডের সময় কিছু করণীয়");
                    intent.putExtra("Description","একটু অসাবধানতার কারণে পিরিয়ডের সময় র\u200C্যাশ, চুলকানি, ইনফেকশনের সমস্যায় ভোগেন অনেক নারীই। এ সময় স্বাস্থ্যের কারণে অবশ্যই কিছু হাইজিন মেনে চলা উচিত।\n" +
                            "\n" +
                            "প্রতি ৪ ঘণ্টা অন্তর প্যাড বদল করুন। যদি পিরিয়ড চলাকালীন পুরো সময়টা নাও পারেন, প্রথম দু’দিন অন্তত করুন। \n" +
                            "\n" +
                            "যদি রিইউজেবল প্যাড ব্যবহার করে থাকেন তা হলে এক বার ব্যবহারের পর অবশ্যই ভালো করে পরিষ্কার করে রাখুন। পরের বার অপরিষ্কার প্যাড ব্যবহার করলে সংক্রমণ ছড়াতে পারে।\n" +
                            "\n" +
                            "পিরিয়ডের সময় শরীর সব সময় পরিষ্কার রাখুন। হালকা গরম পানি দিয়ে পরিষ্কার করলে ইনফেকশনের ঝুঁকি এড়াতে পারবেন। \n" +
                            "\n" +
                            "কখনো দুটো প্যাড একসঙ্গে ব্যবহার করবেন না। অতিরিক্ত রক্তপাতেক কারণে অনেকে এক সঙ্গে দুটো প্যাড ব্যবহার করেন। প্রকৃতপক্ষে একটা প্যাড যতটা তরল শোষণ করতে পারে, দুটো প্যাডও ততটাই করবে।\n" +
                            "\n" +
                            "পরিষ্কার ও আরামদায়ক প্যান্টি পরুন। অপরিষ্কার ও অস্বস্তিকর প্যান্টি থেকে ঘষা লেগে ইনফেকশনের সম্ভাবনা থাকে।");
                    startActivity(intent);
                }else if (i==12){
                    intent.putExtra("Title","লাল আলু খাবেন যে কারণে");
                    intent.putExtra("Description","আমাদের দেশে আলুর উৎপাদন প্রচুর। তাইতো ভাতের পরেই আসে আলুর নাম। তুলনামূলক লাল আলুর উপকারিতা কিছুটা বেশি। লাল আলুতে ভিটামিন ‘এ’, ‘বি’ ও ‘সি’ আছে। এছাড়াও লাল আলুর খোসাতে আছে ভিটামিন ‘এ’, পটাশিয়াম, আয়রন, অ্যান্টি-অক্সাইড, ফাইবারসহ প্রচুর পরিমাণে কার্বোহাইড্রেট।\n" +
                            "\n" +
                            "লাল আলুতে প্রচুর পরিমাণে ভিটামিন ‘সি’ আছে যা রোগ প্রতিরোধ ক্ষমতা বৃদ্ধিতে সহায়ক। একটি মধ্যম আকৃতির (১৫০ গ্রাম) আলুর ত্বকে প্রায় ২৭ মিলিগ্রাম ভিটামিন ‘সি’ আছে। এছাড়া আলুতে পটাশিয়াম, ম্যাগনেসিয়াম, ভিটামিন বি ও আয়রন আছে।\n" +
                            "\n" +
                            "লাল আলুতে প্রচুর পরিমাণে ভিটামিন বি-৬ রয়েছে, যা মন ভালো রাখার জন্য কার্যকরী দুটি উপাদান সেরেটোনিন ও ডোপামিন নামক নিওট্রান্সমিটার গঠনে সহায়তা করে। নিওট্রান্সমিটার মস্তিষ্কে অনুভূতি আদান প্রদান করে থাকে এবং মানসিক চাপ কমিয়ে মন ভালো করতে সহায়তা করে।\n" +
                            "\n" +
                            "ব্লাড প্রেসার ঠিক রাখতে ভীষণভাবে সাহায্য করে আলু। কারণ আলুতে আছে কুকোয়া-মাইনাস নামের এক ধরনের কেমিক্যাল। তবে মনে রাখতে হবে অতিরিক্ত আলু খেলে রক্তে চিনির পরিমাণ বেড়ে যায় এবং ওজন বেড়ে যেতে পারে।\n" +
                            "\n" +
                            "লাল আলুতে গ্লুকোজ, অক্সিজেন, ভিটামিন বি কমপ্লেক্স, এমিনো এসিড, ওমেগা-৩ ও অন্যান্য ফ্যাটি এসিড আছে, যা মস্তিষ্ক সচল ও কর্মক্ষম রাখার জন্য প্রয়োজনীয় উপাদানগুলো সরবরাহ করতে সহায়তা করে।\n" +
                            "\n" +
                            "হজমের পক্ষে আলু খুব ভালো। কারণ আলুতে হাই ফাইভার থাকে।");
                    startActivity(intent);
                }else if (i==13){
                    intent.putExtra("Title","সুস্থ থাকতে টিটক্স");
                    intent.putExtra("Description","চায়ের মাধ্যমে শরীর থেকে টক্সিন দূর করার নাম হল ‘টিটক্স’। ক্লান্ত লাগলে বা সর্দি-কাশি হলে আমরা আদা চা খেয়ে থাকি। কিন্তু চায়েরও রয়েছে অনেক ধরন। প্রায় সব সমস্যার উপশমেই খেতে পারেন চা। সব চা-ই পাওয়া যায় টি-ব্যাগ হিসেবে।\n" +
                            "\n" +
                            "পেট বেশি ভরে গেলে জেসমিন, ক্যামোমাইল, পেপারমিন্ট, মৌরি, ড্যান্ডেলিয়ন, ক্র্যানবেরি চা খান। গলা ব্যথার সমস্যায় কাজে আসবে ক্যামোমাইল, গ্রি টি বা রেড বুশ টি।\n" +
                            "\n" +
                            "গা গোলানো, বমি ভাব কাটাতে সাহায্য করবে পেপারমিন্ট টি।\n" +
                            "\n" +
                            "ত্বকের ঔজ্জ্বল্য বাড়াতে ক্যালেন্ডুলা, ক্যামোমাইল, গ্রিন টি, হোয়াইট টি, লাইকোরিস, রুবার্ব চা খান।\n" +
                            "\n" +
                            "অতিরিক্ত স্ট্রেস ও অনিদ্রার সমস্যায় ক্যামোমাইল, প্যাশন ফ্রুট, লেমনগ্রাস, মিন্ট চা খেলে উপকার পাবেন।\n" +
                            "\n" +
                            "অ্যাসিডিটির সমস্যায় ব্ল্যাক, গ্রিন, টি, উলং, ক্যালেন্ডুলা, রোস্টেড ড্যান্ডেলিয়ন, নেটল, লেমন বাম বা লাইকোরিস রুট চা খান। \n" +
                            "\n" +
                            "\n" +
                            "জ্বর হলে সবচেয়ে ভালো উপশম জিনসেং টি। ক্লান্তি কাটিয়ে যেমন এনার্জি জোগায়, তেমনই রোগ প্রতিরোধ ক্ষমতা বাড়িয়ে তাড়াতাড়ি সুস্থ করে তোলে।\n" +
                            "\n" +
                            "যদি সর্দি-কাশির সমস্যায় ভোগেন তা হলে হোয়াইট ব্লসম, আদা বা থাইম চা খান।");
                    startActivity(intent);
                }else if (i==14){
                    intent.putExtra("Title","পান্তা ভাত কেন খাবেন");
                    intent.putExtra("Description","পান্তা ভাত হলো ভাত সংরক্ষণের একটি পদ্ধতি। রাতের খাবারের জন্য রান্না করা ভাত বেঁচে গেলে সংরক্ষণের জন্য এই ভাতকে নির্দিষ্ট পরিমাণ পানিতে প্রায় এক রাত ডুবিয়ে রাখলেই তা পান্তায় পরিণত হয়। ভাত পুরোটাই শর্করা। ভাতে পানি দিয়ে রাখলে বিভিন্ন গাজনকারী ব্যাক্টেরিয়া বা ইস্ট এই শর্করা ভেঙ্গে ইথানল ও ল্যাকটিক অ্যাসিড তৈরি করে। ল্যাকটিক অ্যাসিড তৈরির ফলে পান্তা ভাতের অম্লত্ব বেড়ে যায় (pH কমে) তখন পচনকারী ও অন্যান্য ক্ষতিকারক ব্যাকটেরিয়া ও ছত্রাক ভাত নষ্ট করতে পারে না।\n" +
                            "\n" +
                            "১০০ গ্রাম পান্তা ভাতে (১২ ঘণ্টা ভিজিয়ে রাখার পর) ৭৩.৯১ মিলিগ্রাম আয়রন থাকে, যেখানে সমপরিমাণ গরম ভাতে থাকে মাত্র ৩.৪ মিলিগ্রাম। এছাড়াও ১০০ গ্রাম পান্তাভাতে পটাশিয়ামের পরিমাণ বেড়ে হয় ৮৩৯ মিলিগ্রাম এবং ক্যালসিয়ামের পরিমাণ বেড়ে হয় ৮৫০ মিলিগ্রাম; যেখানে সমপরিমাণ গরম ভাতে ক্যালসিয়াম থাকে মাত্র ২১ মিলিগ্রাম। এছাড়া পান্তা ভাতে সোডিয়ামের পরিমাণ কমে হয় ৩০৩ মিলিগ্রাম যেখানে সমপরিমাণ গরম ভাতে সোডিয়াম থাকে ৪৭৫ মিলিগ্রাম।\n" +
                            "\n" +
                            "পান্তা ভাত ভিটামিন বি-৬ এবং ভিটামিন বি-১২ এর ভালো উৎস। পান্তাভাত শর্করাসমৃদ্ধ জলীয় খাবার। গরমের দিনে শরীর ঠান্ডা ও সতেজ রাখে। জলীয় খাবার বলে শরীরের পানির অভাব মেটায় এবং শরীরে তাপের ভারসাম্য বজায় রাখে। পান্তা ভাত খেলে শরীর হালকা এবং কাজে বেশি শক্তি পাওয়া যায়, কারণ এটি ফারমেন্টেড বা গাঁজানো খাবার। মানবদেহের জন্য উপকারী বহু ব্যাকটেরিয়া পান্তা ভাতের মধ্যে বেড়ে উঠে।\n" +
                            "\n" +
                            "পেটের পীড়া ভালো হয়, কোষ্ঠবদ্ধতা দূর হয় এবং শরীরে সজীবতা বিরাজ করে এবং শরীরে তাপের ভারসাম্য বজায় থাকে। এ ভাতে পেটের পীড়া ভালো হয়, কোষ্ঠবদ্ধতা দূর হয় এবং শরীরে সজীবতা বিরাজ করে। পাশাপাশি শরীরে তাপের ভারসাম্য বজায় থাকে।");
                    startActivity(intent);
                }else if (i==15){
                    intent.putExtra("Title","ওজন কমাবে যে প্রোটিন");
                    intent.putExtra("Description","ওজন কমানোর জন্য সবচেয়ে জনপ্রিয় হাই প্রোটিন ডায়েট। মাসল মাস বাড়ানোর জন্যও হোয়ে প্রোটিন, সয় প্রোটিনের দিকে ঝুঁকছেন সবাই। তবে সব প্রোটিন কি ওজন কমাতে সাহায্য করে? প্রোটিন কত রকমের হয়? জেনে নিন।\n" +
                            "\n" +
                            "হোয়ে প্রোটিন: স্বাস্থ্য সচেতনদের কাছে খুবই জনপ্রিয় হোয়ে প্রোটিন। ক্ষুধা কমাতে অত্যন্ত কার্যকর হোয়ে প্রোটিন।\n" +
                            "\n" +
                            "প্রাণীজ ও উদ্বিজ্জ প্রোটিন: মাছ, মাংস, ডিম, চিকেন, বাদাম, দুধ, চিজ ডাল ওজন কমানোর জন্য সবচেয়ে উপকারি। সব রকম পুষ্টিগুণের পাশাপাশি এসেনশিয়াল অ্যামাইনো অ্যাসিডের জোগান পায় শরীর।\n" +
                            "\n" +
                            "সয়া প্রোটিন: সয়াবিন থেকে উত্পন্ন সয়া প্রোটিনে সব রকম এসেনশিয়াল অ্যামাইনো অ্যাসিড থাকে। তবে সয়া প্রোটিন ওজন কমাতে কার্যকর কিনা সে বিষয়ে বিশেষজ্ঞরা নিশ্চিত করে কিছু জানান না।\n" +
                            "\n" +
                            "ক্যাসেইন প্রোটিন: দুগ্ধজাত এই প্রোটিনে প্রচুর পরিমাণ অ্যামাইনো অ্যাসিড থাকে। হজম হতে সময় বেশি লাগায় পেট অনেকক্ষণ ভরা থাকে। ফলে ওজন কমাতে সাহায্য করে।\n" +
                            "\n" +
                            "পি প্রোটিন: এই ধরনের প্রোটিনে ডেয়ারি প্রোটিনের মতো প্রচুর পরিমাণ এসেনশিয়াল অ্যামাইনো অ্যাসিড থাকে। যা অনেকক্ষণ পেট ভরা রাখতে সাহায্য করে। শারীরিক গঠনেও সাহায্য করে।\n" +
                            "\n" +
                            "রাইস প্রোটিন: রাইস প্রোটিনে সব রকম এসেনশিয়াল অ্যামাইনো অ্যাসিড থাকে না। আবার অনেক সময়ই রাইস প্রোটিনের সঙ্গে পি প্রোটিন মেশানো থাকে। তবে হোয়ে প্রোটিনের মতো রাইস প্রোটিন ফ্যাট কমাতে ও লিন মাস বাড়াতে সাহায্য করে।\n" +
                            "\n" +
                            "হেম্প প্রোটিন: এই উদ্ভিজ্জ প্রোটিন ওমেগা থ্রি ফ্যাটি অ্যাসিড ও ফাইবারে ভরপুর। কিন্তু এসেনশিয়াল অ্যামাইনো অ্যাসিড না থাকায় হেম্প প্রোটিন অসম্পূর্ণ।\n" +
                            "\n" +
                            "বোন ব্রথ প্রোটিন: পশু-পাখির হাড় গরম পানিতে ফুটিয়ে এই প্রোটিন তৈরি করা হয়। এর ফলে হাড়ের পুষ্টিগুণ বেরিয়ে যায়। এই প্রোটিন তাই অসম্পূর্ণ প্রোটিন।");
                    startActivity(intent);
                }else if (i==16){
                    intent.putExtra("Title","সিগারেট ছাড়তে চাইলে যা খাবেন ");
                    intent.putExtra("Description",
                            "সিগারেট ধরা যতটা সহজ, ছাড়া ঠিক ততটাই কঠিন। হয়তো প্রতিদিনই সিগারেট ছাড়ার প্রতিজ্ঞা করছেন, কিন্তু আবার প্রতিজ্ঞা ভঙ্গও করছেন। তবে যদি সত্যিই সিগারেট ছাড়তে চান, তাহলে আপনাকে সাহায্য করতে পারে এই খাবারগুলো-\n" +
                                    "\n" +
                                    "সিগারেট শরীর থেকে ভিটামিন সি শুষে নেয়। ফলে সিগারেটের নেশা বাড়ে। যদি ধূমপান ছাড়তে চান তবে নিয়মিত কমলালেবু, মোসাম্বি বা বেদানা জাতীয় ফল খান। এতে রয়েছে প্রচুর পরিমাণ ভিটামিন সি। যা সিগারেটের নেশা কমাতে সাহায্য করবে।\n" +
                                    "\n" +
                                    "ডিউক ইউনিভার্সিটির গবেষকরা জানাচ্ছেন ধূমপানের আগে এক গ্লাস দুধ খেলে সিগারেটের স্বাদ ভালো লাগবে না। দুধের পর সিগারেট খেলে মুখ তেতো হয়ে যাবে। ধূমপান ছাড়তে চাইলে সিগারেট খাওয়ার আগে দুধে ডুবিয়ে নিন। তিতকুটে স্বাদের চোটে খেতেই পারবেন না।\n" +
                                    "\n" +
                                    "দুধের মতোই শশা, গাজর, বেগুন, সেলারি পাতা খেলেও সিগারেটের স্বাদ তেতো লাগে। চিকিত্সকরা বলেন ডায়েটে বেশি পরিমাণ শাক-সবজি থাকলে সিগারেটের উপর নির্ভরশরীলতা কমে। \n" +
                                    "\n" +
                                    "যখনই সিগারেট খেতে ইচ্ছা হবে তখনই নোনতা কিছু খেয়ে নিন। নোনতা চিপস, বিস্কিট বা জিভে সামান্য লবণ লাগিয়ে নিলেও সিগারেট খাওয়ার ইচ্ছা চলে যাবে। নেশা কমবে। সিগারেট খেতে ইচ্ছা হলে মুখে এক কুচি আদা রেখে চিবোতে থাকুন। অবিলম্বে সিগারেট খাওয়ার ইচ্ছা চলে যাবে।\n" +
                                    "\n" +
                                    "প্রতি দিন একমুঠো বাদাম খেলে শরীরে প্রোটিন, প্রয়োজনীয় খনিজের ঘাটতি মেটে। নিয়মিত খেলে ধীরে ধীরে সিগারেটের নেশা কেটে যায়।\n" +
                                    "\n" +
                                    "সিগারেটের নেশা কাটাতে মুখে রাখুন সুগার ফ্রি গাম। এতে সিগারেটের নেশা চলে যাবে। তবে মিষ্টি চিউইং গাম কিন্তু নেশা বাড়িয়ে দেবে। তাই অবশ্যই সুগার ফ্রি চিউইং গাম চিবোতে থাকুন। ");
                    startActivity(intent);
                }

            }
        });
    }
}
